{
    "event_info": [
        {
            "title": "London Edition",
            "when": "23 May, 2014",
            "where": "Shoreditch Village Hall",
            "map": "https://www.google.com/maps/place/Shoreditch+Village+Hall/@51.527605,-0.080866,17z/data=!3m1!4b1!4m2!3m1!1s0x48761cbadd0ebb53:0x20694e9b38ebbe9",
            "city_slug": "london",
            "address": "33 Hoxton Square, London N1 6NN, United Kingdom",
            "what": "<p>Hacker Olympics is a new, interactive spin on the basic hackathon. Hackers participate in a tournament, where diverse knowledge and skills help them to conquer a wide range of challenges. Accumulate points in a race to Hacker Olympics supremacy.</p><p>\nAt 7pm, it’s pencils down and laptops closed. The Top 3 Teams will be awarded prizes and named Hacker Olympic Medalists!</p>",
            "how": "<p>\nThe Hacker Olympics is the anti-hackathon. There are no pitch decks, no presentations and only hackers are invited. It is a fast-paced event where teams compete for three hours against each other to finish in the top 3 teams. Teams complete challenges to earn points, each of which make hackers think quickly, creatively and often outside their comfort zone.</p><p>Use skills you didn’t know you had to reign victorious over the likes of Startup Charades, Anti-optimiser and more.</p>"
        }
    ],
    "schedule": [
        {
            "scheduletimes": "12:00 - 1:00",
            "scheduleevent": "Eat, meet and greet"
        },
        {
            "scheduletimes": "1:00 - 1:30",
            "scheduleevent": "Introductions"
        },
        {
            "scheduletimes": "1:30 - 6:30",
            "scheduleevent": "Let the games begin!"
        },
        {
            "scheduletimes": "6:30 - 7:30 PM",
            "scheduleevent": "Awards, prizes and glory"
        }
    ],
    "sponsors": [
        {
            "sponsorname": "Twilio",
            "sponsorimg": "twilio.png",
            "sponsorurl": "http://twilio.com"
        },
        {
            "sponsorname": "importio",
            "sponsorimg": "importio.png",
            "sponsorurl": "https://import.io"
        },
        {
            "sponsorname": "Sendgrid",
            "sponsorimg": "send-grid.png",
            "sponsorurl": "http://sendgrid.com"
        }
    ],
    "challenges": [
        {
            "challengetitle": "Startup Charades - Scheduled",
            "rules": "<p>This is our Throwdown Challenge for the day - find a team you want to take on head to head and head up to the stage for Startup Charades.</p>\n \n<p>Charades is a game of pantomimes: you have to \"act out\" a phrase (in this case, a startup) without speaking, while the other members of your team try to guess what the phrase is. The objective is for your team to guess the phrase as quickly as possible.</p>\n \n<p>Each team can choose 3 players who each get 2 minutes to act out as many clues as possible. While TEAM A is acting out clues TEAM B should be keeping time.</p>\n \n<p><strong>Game Play:</strong>\nA player from TEAM A must draw a piece of paper from the Businessy Entrepreneurial Answer Receptacle (B.E.A.R) and act it out silently for the rest of his teammates. At the end of two minutes TEAM A should tally their correct answers and write it on the whiteboard.</p>\n \n<p>As soon as TEAM A completes their first round, TEAM B should choose a player to act out clues. This should of course repeat until either: 3 players from each team has acted out clues.</p>",
            "scoring": "<p>10 points per corect answer.</p>\n<p>The winning team will get 25 additional bonus points.</p>",
            "judges": "<p>Record the number of correct answers from each team.</p><p>Indicate which of the two teams is the winner.</p>",
            "bonusscore": 25,
            "scoreunit": "Correct Answers",
            "scoreunitmultiplier": 10
        },
        {
            "challengetitle": "Stack Overflow",
            "rules": "<p>You will be given 100 Cups. You must stack them as high as possible to create a tower. You cannot put one cup 'inside' another, or use chairs/tables etc. to help build the tower. You may however, use your team mates... You will have 10 minutes to build as high as you can. Your tower must only be made of cups, no tape, gum or magic.</p><p>Interested in scoring some bonus points? Shoot for the ceiling! Report with your entire team when you’re ready to try your hand to the conference room.</p>",
            "scoring": "<P>10 Points for every layer of cups. Stacking cups 'inside' each other does not count as a layer. 50 Bonus points for touching the ceiling with the cup, or being unable to fit another cup on top due to the height of the ceiling.</P>",
            "judges": "<p>Count how many cups high the tower is, award that score.</p><p>If it is not possible to add more cups due to the height of the ceiling, award bonus points. Hanging obstructions do not count.</p>",
            "bonusscore": 50,
            "scoreunit": "Layers of Cups",
            "scoreunitmultiplier": 10
        },
        {
            "challengetitle": "Escher's Login",
            "rules": "<p>Build a web based user authentication system that utilizes no &lt;form&gt; or &lt;input&gt; fields. Your system must not accept a username or password from the user. Be creative and come up with a unique authentication system using alternative verification methods (ex. Voice verification, key-press detection, bluetooth , etc.)</p>",
            "scoring": "<p>100 points for a working login system</p>",
            "judges": "Have the person demo their code. Check the HTML and ask them to explain how it works.",
            "basescore": 100,
            "bonusscore": 0
        },
        {
            "challengetitle": "Hacker Relay Race",
            "rules": "<p>Create a new git repo. Give each of your team members access to it. One of your team members should create the first portion of an application that utilizes the Hacker Olympics <a href=\"http://hacker-olympics-london.herokuapp.com/leaderboard.json\">API (http://hacker-olympics-london.herokuapp.com/leaderboard.json)</a>. Each of your team members must then create their own branch of the application and merge their code via a Pull Request.</p>",
            "scoring": "<p>100 points for completion</p>",
            "judges": "Have the team demo their app, confirm that all team members have branched and committed to the project and that theyr'e using the leaderboard json.",
            "resourcetitle": "Hacker Olympics Leaderboard JSON",
            "resourceurl": "http://hacker-olympics-london.herokuapp.com/leaderboard.json",
            "basescore": 100,
            "bonusscore": 0
        },
        {
            "challengetitle": "Substack Rube Goldburg Challenge",
            "rules": "Pass this string of data {'hackerolympics': 'dope', 'chipotle': {'price': 'nope', 'originality':'nope'}} through as many node.js modules written by <a href=\"https://github.com/substack?tab=repositories\">substack (https://github.com/substack)</a> as possible.",
            "scoring": "20 points per module used.",
            "judges": "Have the team demo their application to you, and show you each Substack Module they are accessing. The team will get 20 points for each module in the chain once it has been proven to work successfully.",
            "resourcetitle": "Substack Modules",
            "resourceurl": "https://github.com/substack?tab=repositories",
            "scoreunit": "Modules Used",
            "scoreunitmultiplier": 20
        },
        {
            "challengetitle": "Songs as Code",
            "rules": "Go to <a href=\"http://thehackerolympics.com/songsascode.html\">http://thehackerolympics.com/songsascode.html</a> &ndash; here you will find a list of code snippets that each represent a song. Guess what song each snippet represents and write down your answers. Call over a judge to verify them and submit your score!",
            "scoring": "10 points per correct guess",
            "judges": "They should only submit their answers once for this challenge! Check they do not already have a score. Enter the number of correct answers they get, by ticking them off against this list:\n\n<a href=\"https://gist.github.com/xmjw/7fe6aec376ac88de360f\">https://gist.github.com/xmjw/7fe6aec376ac88de360f</a>\n\n<p>gistfile1.js - Real Slim Shady - Eminem</p>\n<p>gistfile10.js - Don’t Stop the Party - Pitbull</p>\n<p>gistfile11.js - What Does the Fox Say - Ylvis</p>\n<p>gistfile12.js - Mambo #5 - Lou Bega</p>\n<p>gistfile13.js - Washington - Cox and Combes</p>\n<p>gistfile14.js - Beatles - When I’m 64</p>\n<p>gistfile15.js - Queen - Bohemian Rhapsody</p>\n<p>gistfile16.js - I walk the line - Johnny Cash</p>\n<p>gistfile17.js - Boy Named Sue - Johnny Cash</p>\n<p>gistfile18.js - 500 Miles - the Proclaimers</p>\n<p>gistfile19.js - It was a good day - Ice Cube</p>\n<p>gistfile2.js - Blurred Lines - Robin Thicke</p>\n<p>gistfile20.js - Black or White - Michael Jackson</p>\n<p>gistfile21.js - (I Cant Get No) Satisfaction - Rolling Stones</p>\n<p>gistfile22.js - Get Lucky - Daft Punk</p> \n<p>gistfile23.js - Fake Plastic Trees - Radiohead</p>\n<p>gistfile24.js - Macklemore - Same Love</p>\n<p>gistfile25.js - Stuck in the middle with you - Stealers Wheel</p>\n<p>gistfile26.js - Girl You Know It's True - Milli Vanilli</p>\n<p>gistfile27.js - Work it - Missy Elliot</p>\n<p>gistfile3.js - Just the Two of Us - Bill Withers</p>\n<p>gistfile4.js- Higher - Creed</p>\n<p>gistfile5.js - Part of your world - Little Mermaid</p>\n<p>gistfile6.js - Bird is the word - Surfin' Bird</p>\n<p>gistfile7.js - Party, Party, Party - Andrew W.K.</p>\n<p>gistfile8.js - Cannonball by the Breeders</p>\n<p>gistfile9.js - Wrecking Ball - Miley Cyrus</p>\n",
            "resourcetitle": "Hacker Olympics Songs as Code List",
            "resourceurl": "http://thehackerolympics.com/songsascode.html",
            "scoreunit": "Total Songs Correct",
            "scoreunitmultiplier": 10
        },
        {
            "challengetitle": "The Anti-Optimizer",
            "rules": "Write a script that has a runtime of as close to 42 seconds as possible as determined by the `time` command. You may not use any time-based delays, counters, network requests, or waits to achieve this runtime. You may achieve the runtime through inefficient code, unwise server configurations, or any other creative means.",
            "scoring": "100 points for writing a script that is within a +/- 5 second runtime of 42 seconds\n<br>\nBONUS: 50 points for hitting between a +/- 500ms runtime of 42 seconds",
            "judges": "Have them run their script with the `time` command (ex. time ruby app.rb), if it is 41.5 to 42.5 seconds they get 150 points, if it is between 37 and 47 seconds they get 100 points.",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "Peter’s Game\n",
            "rules": "In Ender’s Game, Peter Wiggin was able to track phrases used on the Internet - find where they originated and how they traveled. Build your own version of this system, tracking where a tweet or comment originates and show how it travels on a map.\n",
            "scoring": "200 points for creating the dynamic map. <br/> BONUS: 100 points for making it update in real-time using <b>firebase</b> for real-time data storage.",
            "judges": "Verify that the map is being generated by code, not simply a hard-coded prototype. For Bonus tweet a key word and verify that the tweet appears on the map.",
            "basescore": 200,
            "bonusscore": 100
        },
        {
            "challengetitle": "UrbanSpotting.xxx",
            "rules": "Write a startup name generated via a script that uses Urban Dictionary as it's data source. Bonus points for publishing a 3-slide deck.",
            "scoring": "50 points for writing the name generator. <br/> BONUS: 100 points for sending a 3-slide deck explaining the company.",
            "judges": "Verify the code. Have them tweet a link to the deck at @thehackerolympics",
            "basescore": 50,
            "bonusscore": 100
        },
        {
            "challengetitle": "Use The Force",
            "rules": "In a mobile browser implement a light saber app that replicate the noise of a light saber when you wave the phone. You must create your own sound effects.",
            "scoring": "100 points for getting your saber on.",
            "judges": "Wave the phone. Check that it works.",
            "basescore": 100
        },
        {
            "challengetitle": "SendGrid-a-licious",
            "rules": "Make a basic contact form that sends an email using SendGrid. Must use JavaScript for the sending. <b> Bonus points</b> if you build the entire thing in front-end JavaScript with only the necessary hardcoded  html, head, body, etc tags to render the page.",
            "scoring": "50 points for successfully sending an email using SendGrid. <br /> Bonus: 100 points for building the entire thing out of javascript.",
            "judges": "Verify that the script sends an email. Check the source code.",
            "resourcetitle": "Sendgrid Docs",
            "resourceurl": "http://sendgrid.com/docs/",
            "basescore": 50,
            "bonusscore": 100
        },
        {
            "challengetitle": "Money Money Money",
            "rules": "Can you get the Hacker Olympics hashtag into the BitCoin block chain?",
            "scoring": "500 points",
            "judges": "Ensure that the #HackerOlympics hashtag is included in the BlockChain as either an Input or Output string. Use the Transaction ID and https://blockchain.info/ to check.",
            "basescore": 500
        },
        {
            "challengetitle": "Simpsons Blackboard",
            "rules": "We love the Simpsons. But Bart has been writing on that blackboard for 25 years. Use import.io and this handy data source to create your visualisation: http://bit.ly/1giiJSB (Create a free import.io account first to get started!)",
            "scoring": "100 Points for createing a successful visualisation. 50 Bonus points for exluding common words, such as 'I', 'the', 'and' etc.",
            "judges": "Check that the team have created a visualisation, look at the data, and the import.io collector they are using.",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "Rondomkey",
            "rules": "Create a text form in a web page, which can emulate changing between a UK/French/German/Devorak keyboard on every 15th key stroke.",
            "scoring": "20 points for every keyboard type  supported.",
            "judges": "Use a single key, you can repeat this 15 times to see if the keyboard changes, and by looking at the supported keyboards you'll know what to expect.",
            "scoreunit": "Keyboards Supported",
            "scoreunitmultiplier": 20
        },
        {
            "challengetitle": "!Coffee",
            "rules": "Shoreditch is full of posh coffee shops. We've given you sachets of Nescafe, and convince one of the coffee shops to make you a cup. Vine the whole thing with the #HackerOlympics hashtag. It must not be a chain store (starbucks etc) and not the coffee shop attached to this venue. The Barista must make the whole coffee, and this should be clear.",
            "scoring": "150 points if you come back with a Vine of the Barista making the coffee posted with the #HackerOlympics hashtag. 50 Bonus points if they may it into a Cappucino.",
            "judges": "The vide should have the hash tag, and clearly show the barista making the coffee.<br/>Bonus points if the barista made them a cappucino",
            "basescore": 150,
            "bonusscore": 50
        },
        {
            "challengetitle": "Flappy 2048",
            "rules": "Get to 2048 on Flappy 2048 (http://flappy2048.com/).  ",
            "scoring": "<P>300 points if you show a judge the 2048 tile.<P> ",
            "judges": "See the end state, the final tile will be visible.",
            "basescore": 300
        },
        {
            "challengetitle": "NgrokBus",
            "rules": "Build a bus network for each member of your team using an app running on <A href=\"https://ngrok.com/\">NGrok (http://www.ngrok.com)</a>, make them play chinese whispers by sending a string round the entire team. Each application should repleace one character of the string with a different letter.",
            "scoring": "<P>150 points if the data goes to each member of the team, and 1 character is modified</P>",
            "judges": "Ask them to send a specific word, and check the output on each screen.",
            "basescore": 150
        },
        {
            "challengetitle": "CaesarSalad",
            "rules": "You have been given an encrypted string using a ceasar cypher, break it. Each team has a different cypher.",
            "scoring": "100 points for solving your cypher.",
            "judges": "Check the answer to the cypher against that in your Judges Handout.",
            "basescore": 100
        },
        {
            "challengetitle": "You Brute",
            "rules": "<P>This is an MD5 hash of a 5 letter password: 98a2966d4d87b3b62b2b9241e3d517ff</P><P>It only contains alphachars (a-z), but it is the pasword to the HackerOlympics 1Password account. It would be just super if you can use a brute force attack to get the password, because we forgot what it was... Points will be awarded!</P>  ",
            "scoring": "150 points for breaking the password.",
            "judges": "<P>The password is 'nmeno'. Chosen because if they start with aaaaa or zzzzz it's in the approximate middle of the space.</P>",
            "basescore": 150
        },
        {
            "challengetitle": "LetMeBingThatForYou",
            "rules": "Sending people a link to <a href=\"http://www.lmgtfy.com\">'Let me Google that for you' (http://www.lmgtfy.com)</a> is a <em>subtle</em> way of suggesting they look something up. Create a 'let me google that for you' clone that allows users to send a link that automatically runs a Microsoft Bing search. It should feature the same automatically typed search query.",
            "scoring": "100 points for creating the clone, it must be possible to email the search links. 50 bonus points if it plays a microwave bing.",
            "judges": "This should be a clone that looks a fair bit like Bing. Make sure the attendee has not used 'lmbtfy.com'",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "Hacker Olympics Does Qwop",
            "rules": "<P>Some games are hard. Some games are crazy-hard. <A href=\"http://www.foddy.net/Athletics.html\">Qwop (http://www.foddy.net/Athletics.html)</A> is a little bit harder still. In this game you use your keyboard to control the athletes legs. Every meter forward you run gets you 1% of the points. Keep at it, if you improve your score the judges can increase your points!</P>",
            "scoring": "<P>The games will give you a score on a per-meter basis, for ever 1 meter you run, you get 10 points.</P>",
            "judges": "Check their maximum distance in Qwop. Enter the exact number to <strong>one decimal place</strong>. The app will calculate the correct score. For example, 3.4 meters will be 34 points.",
            "scoreunit": "Meters Run",
            "scoreunitmultiplier": 10
        },
        {
            "challengetitle": "UA Pokemon",
            "rules": "<P>Create a web app that logs all unique Browser User Agents (i.e. 'curl/7.30.0').  You can log this information in any way you please, and feel free to tweet with the #hackerolympics hashtag to get more visits to your page!</P>",
            "scoring": "<P>1 point for every user agent you collect, up to a maximum of 100 points.</P>",
            "judges": "See <a href=\"http://www.useragentstring.com/pages/Browserlist/\">here</a>. Count how many user agents there are (feel free to ask the attendee to sort them in a text file). Then assign enter the number of unique user agents in the app. Maximum 100.",
            "scoreunit": "User Agents Collected",
            "scoreunitmultiplier": 1
        },
        {
            "challengetitle": "That's Twumberwang!",
            "rules": "<p>Create a working multiplayer version of the British classic game show That's Numberwang! using Twilio Voice or SMS.  App may use Interactive Voice Response, SMS or whatever other creative telephony you can think of, but must produce a highly competitive gaming experience like the original show.  For a refresher, <a href=\"https://www.youtube.com/watch?v=qjOZtWZ56lc\">view this video (http://bit.ly/1lJG917)</a>.</p>",
            "scoring": "<p>100 points.  Bonus 50 points for original audio clips.</p>",
            "judges": "<p>Call or text number to play Numberwang.  Must be able to put in a series of numbers and eventually hear or see \"That's Numberwang!\"  Bonus points if you hear the announcer \"That's Numberwang!\" clip.</p>",
            "basescore": 100,
            "bonusscore": 50
        }
    ],
    "rules": [
        {
            "rule": "<strong>The Format:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "15 minutes before The Hacker Olympics begins, we will publish a list of challenges." 
        },
        {
            "rulenumber": 2,
            "rule": "For each challenge that your team completes the team will receive points.  Team with the most points at the end wins."
        },
        {
            "rulenumber": 3,
            "rule": "Different hackers on the same team may be completing <strong>different</strong> challenges. Working as a team equals most win."
        },
        {
            "rulenumber": 4,
            "rule": "When you believe your team has completed a challenge, simply wave the glow baton at your table. This will alert a judge to come check your work. Show off the hack to the judge to get your points."
        },
        {
            "rulenumber": 5,
            "rule": "<strong>Startup Charades</strong> is our Throwdown Challenge. Pick a team to faceoff against in Startup Charades and head up to the stage to take them on in a head to head battle.  You'll receive 10 points for every correct answer and a bonus 50 if your team wins.  "
        },
        {
            "rulenumber": 6,
            "rule": "<strong>Stack Overflow</strong> is our All Team Challenge. When you are ready to build the bossest tower, rally your entire team together to head over to the conference room to take your turn at this epic contest.  You'll need every hand available to help."
        },
        {
            "rulenumber": 7,
            "rule": "If you finish all available challenges, you are a baller! Check the rules and attempt to get the bonus points for every challenge that has bonus points."
        },
        {
            "rule": "<strong>The Rules:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "Teams are a minimum of 4 people, a maximum of 6.  Ideal size is 5 and even more ideal constitution is people who don't know each other - teams of strangers routinely win the Hacker Olympics."
        },
        {
            "rulenumber": 2,
            "rule": "No Larping. Even if you have a lightsaber from last years Hacker Olympics. Larping kills."
        },
        {
            "rule": "<strong>The Scoring:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "When a team (or hacker from a specific team) completes a challenge, points will be added by the judge."
        },
        {
            "rulenumber": 2,
            "rule": "You can follow the rank of your team on the <a href=\"http://thehackerolympics.com/leaderboard/ \" style=\"color:white; text-decoration:underline\">Leaderboard</a>."
        },
        {
            "rulenumber": 3,
            "rule": "Some challenges are worth a fixed number of points. Other challenges are scored on a tier, where the team will be awarded points according to their placement. (Example: 1st Place: 100 pts, 2nd Place: 50 pts, 3rd Place: 25 pts). "
        }
    ]
}
