{
    "event_info": [
        {
            "what": "<p>Hacker Olympics is a new, interactive spin on the basic hackathon. Hackers participate in a tournament, where diverse knowledge and skills help them to conquer a wide range of challenges. Accumulate points in a race to Hacker Olympics supremacy.</p><p>\nAt 10:00pm, it’s pencils down and laptops closed. The Top 3 Teams will be awarded prizes and named Hacker Olympic Medalists!</p>",
            "how": "<p>\nHackerOlympics.js is a fast-paced event where teams compete for three hours against each other to finish in the top 3 teams. Teams complete challenges to earn points, each of which make hackers think quickly, creatively and often outside their comfort zone.</p><p>Use skills you didn’t know you had to reign victorious over the likes of Startup Charades, Songs as Code, UrbanSpotting.xxx and more.</p>"
        }
    ],
    "schedule": [
        {
            "scheduletimes": "6:00 - 7:00",
            "scheduleevent": "Eat, form teams, challenges released"
        },
        {
            "scheduletimes": "7:00 - 10:00",
            "scheduleevent": "Hack, play, compete"
        },
        {
            "scheduletimes": "10:00-10:30",
            "scheduleevent": "Hacker Olympics Awards Ceremony"
        }
    ],
    "sponsors": [
        {
            "sponsorname": "Twilio",
            "sponsorimg": "twilio.png",
            "sponsorurl": "http://twilio.com"
        },
        {
            "sponsorname": "Firebase",
            "sponsorimg": "firebase.png",
            "sponsorurl": "http://firebase.com"
        },
        {
            "sponsorname": "Sendgrid",
            "sponsorimg": "send-grid.png",
            "sponsorurl": "http://sendgrid.com"
        }
    ],
    "challenges": [
        {
            "challengetitle": "Startup Charades - Scheduled",
            "rules": "<p>Teams must pair up with another team so that at each Station so there are 2 teams competing against one another.</p>\n \n<p>Charades is a game of pantomimes: you have to \"act out\" a phrase (in this case, a startup) without speaking, while the other members of your team try to guess what the phrase is. The objective is for your team to guess the phrase as quickly as possible.</p>\n \n<p>Each team can choose 3 players who each get 2 minutes to act out as many clues as possible. While TEAM A is acting out clues TEAM B should be keeping time.</p>\n \n<p><strong>Game Play:</strong>\nA player from TEAM A must draw a piece of paper from the Businessy Entrepreneurial Answer Receptacle (B.E.A.R) and act it out silently for the rest of his teammates. At the end of two minutes TEAM A should tally their correct answers and write it on the whiteboard.</p>\n \n<p>As soon as TEAM A completes their first round, TEAM B should choose a player to act out clues. This should of course repeat until either: 3 players from each team has acted out clues.</p>",
            "scoring": "10 points per corect answer</br>\nBONUS: 25 points to the winning team",
            "judges": "Record the team numbers and how many corresponding correct answers they got for each charades station."
        },
        {
            "challengetitle": "Stack Overflow - Scheduled",
            "rules": "<p>6 teams compete at once. Each team gets 100 Cups. The objective is to stack cups as high as possible using only each other and the cups to create a structure that will stand tallest. No object other than cups can be part of the structure. No free-standing objects may be used to raise a hacker’s height to place cups higher up. People are a different story…</p>\n \n<p>At the end of 10 minutes the team with the highest stack of cups will be named winner. The 2nd and 3rd highest stacks will also win points.</p>\n\n<p><strong>Special Case:</strong> If two (or more) teams are tied at the end of the 10 minutes a rapid-fire tie-breaking row must take place. The tied teams need to create a stack of single cups one on top of the previous, and the team with the highest single stack of cups is named winner. This team should receive a BONUS level to their official Stack Overflow score. So if two teams are tied with a level-count of 25 levels, the team who wins the tie-breaker will receive a bonus level to their score, making their final level-count 26.</p>",
            "scoring": "1st place: 100 pts</br>\n2nd Place: 70 pts</br>\n3rd Place: 45 pts</br>",
            "judges": "Count the levels of cups to determine who is the winner. Record the team number and level of cups in the score sheet for each of the 6 teams competing in this round."
        },
        {
            "challengetitle": "Escher’s Login",
            "rules": "<p>Build a user authentication system that utilizes no form fields or input fields. Your system must not accept a username or password from the user. Be creative and come up with a unique authentication system using alternative verification methods (ex. Voice verification, key-press detection, bluetooth , etc.)</p>",
            "scoring": "100 points – For completing the main challenge",
            "judges": "Have the team demo their application to you. Look for creative solutions here. ",
            "basescore": 100,
            "bonusscore": 0
        },
        {
            "challengetitle": "Hacker Relay Race",
            "rules": "Create a new git repo. Give each of your team members access to it. One of your team members should create the first portion of an application that utilizes the Hacker Olympics leaderboard.json API. Each of your team members must then create their own branch of the application and merge their code via a Pull Request.",
            "scoring": "100 points for completion",
            "judges": "Have the team demo their app, confirm that all team members have branched and committed to the project and that theyr'e using the leaderboard json.",
            "resourcetitle": "Hacker Olympics Leaderboard JSON",
            "resourceurl": "http://judgingjs.herokuapp.com/leaderboard.json",
            "basescore": 100,
            "bonusscore": 0
        },
        {
            "challengetitle": "Substack Rube Goldburg Challenge",
            "rules": "Pass this string of data {'hackerolympics': 'dope', 'chipotle': {'price': 'nope', 'originality':'nope'}} through as many node.js modules written by <a href=\"https://github.com/substack?tab=repositories\">substack</a> as possible.",
            "scoring": "20 points per module used.",
            "judges": "Have the team demo their application to you, and show you each Substack Module they are accessing. The team will get 20 points for each module in the chain once it has been proven to work successfully.",
            "resourcetitle": "Substack Modules",
            "resourceurl": "https://github.com/substack?tab=repositories"
        },
        {
            "challengetitle": "Songs as Code",
            "rules": "Go to <a style=\"color:white; text-decoration:underline\"  href=\"http://thehackerolympics.com/songsascode.html\">http://thehackerolympics.com/songsascode.html</a> &ndash; here you will find a list of code snippets that each represent a song. Guess what song each snippet represents and write down your answers. Call over a judge to verify them and submit your score!",
            "scoring": "10 points per correct guess",
            "judges": "Confirm each answer with the master list in the judging app, give the team 10 points * the number of correct answers they go. They should only submit their answers once for this challenge!\n\n<a href=\"https://gist.github.com/scottmotte/a1044371ed0e5b051658\">RUBRIC</a>",
            "resourcetitle": "Hacker Olympics Songs as Code List",
            "resourceurl": "http://thehackerolympics.com/songsascode.html"
        },
        {
            "challengetitle": "The Anti-Optimizer",
            "rules": "Write a script that has a runtime of as close to 42 seconds as possible as determined by the `time` command. You may not use any time-based delays, counters or waits to achieve this runtime. You may achieve the runtime through inefficient code, unwise server configurations, or any other creative means.",
            "scoring": "100 points for writing a script that is within a +/- 5 second runtime of 42 seconds\n<br>\nBONUS: 50 points for hitting between a +/- 500ms runtime of 42 seconds",
            "judges": "Have them run their script with the `time` command (ex. time ruby app.rb), if it is 42 exactly they get 150 points, if it is between 37 and 47 seconds they get 100 points.",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "Digital Rooster",
            "rules": "Do you miss the days when your neighbordhood rooster would wake you up at sunrise? Using Node.js, return to those times by building an alarm clock app that wakes you up when the sun rises in Vancouver. You can use any method for waking up that you desire. For judging, program the ability to trigger alarm on-demand and show the schedule sunrise time.",
            "scoring": "100 points for successsfully building the app.<br />BONUS: 50 points for opening up signup to users",
            "judges": "Trigger alarm. Confirm that sunrise time is accurate and that some sort of alarm mechanism fires. Sunrise in Vancouver tomorrow is 7:35am.",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "Scorched Earth",
            "rules": "Write a browser extension for your favorite browser that pays homage to classic turn-based strategy game <a href=\"https://en.wikipedia.org/wiki/Scorched_Earth_(video_game)\">Scorched Earth</a>. Keep it simple, just have one tank that uses the current websites content as a playing field. Once you're able to have a tank properly destroy page content, let a judge know.",
            "scoring": "200 points for successfully building extension.",
            "judges": "Use extension on nytimes.com. Confirm tank properly destroys page content.",
            "basescore": 200,
            "bonusscore": 0
        },
        {
            "challengetitle": "Peter’s Game\n",
            "rules": "In Ender’s Game, Peter Wiggin was able to track phrases used on the Internet - find where they originated and how they traveled. Build your own version of this system, tracking where a tweet or comment originates and show how it travels on a map.\n",
            "scoring": "200 points for creating the dynamic map. <br/> BONUS: 100 points for making it update in real-time using <b>firebase</b> for real-time data storage.",
            "judges": "Verify that the map is being generated by code, not simply a hard-coded prototype. For Bonus tweet a key word and verify that the tweet appears on the map.",
            "basescore": 200,
            "bonusscore": 100
        },
        {
            "challengetitle": "UrbanSpotting.xxx",
            "rules": "Write a startup name generated via a script that uses Urban Dictionary as it's data source. Bonus points for publishing a 3-slide deck.",
            "scoring": "50 points for writing the name generator. <br/> BONUS: 100 points for sending a 5-slide deck explaining the company.",
            "judges": "Verify the code. Have them tweet a link to the deck at @thehackerolympics",
            "basescore": 50,
            "bonusscore": 100
        },
        {
            "challengetitle": "Use The Force",
            "rules": "In a mobile browser implement a light saber app that replicate the noise of a light saber when you wave the phone.",
            "scoring": "100 points for getting your saber on.",
            "judges": "Wave the phone. Check that it works.",
            "basescore": 100
        },
        {
            "challengetitle": "Hacker Newz Filter",
            "rules": "Write an extension for your favorite browser that hides article entries on news.ycombinator.com that contain certain keywords.",
            "scoring": "100 points for successfuly demoing your extension. <br /> BONUS: 50 points for altering the headlines.",
            "judges": "Verify that the extension works. Verify the source code.",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "What Does a Mom Tweet?",
            "rules": "Write a Twilio app that allows your mom to tweet on her very own account, without ever visiting twitter.com. She should be able to tweet embarrasing things, by simply sending a text.",
            "scoring": "100 points for successfully tweeting via SMS from your phone, under a new twitter account. <br /> BONUS: 50 points for using Twilio VOICE.",
            "judges": "Verify that the app tweets after they send it a text. For bonus call the number and see if it tweets.",
            "resourcetitle": "Twilio Docs",
            "resourceurl": "http://twilio.com/docs",
            "basescore": 100,
            "bonusscore": 50
        },
        {
            "challengetitle": "SendGrid-a-licious",
            "rules": "Make a basic contact form that sends an email using SendGrid. Must use JavaScript for the sending. <b> Bonus points</b> if you build the entire thing in front-end JavaScript with only the necessary hardcoded  html, head, body, etc tags to render the page.",
            "scoring": "50 points for successfully sending an email using SendGrid. <br /> BONUS: 100 points for building the entire thing out of javascript.",
            "judges": "Verify that the script sends an email. Check the source code.",
            "resourcetitle": "Sendgrid Docs",
            "resourceurl": "http://sendgrid.com/docs/",
            "basescore": 50,
            "bonusscore": 100
        }
    ],
    "rules": [
        {
            "rule": "<strong>The Format:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "15 minutes before The Hacker Olympics begins, we will publish a list of challenges. Other than the Required Challenges, which you must complete, you may choose to complete as many or as few challenges as you wish."
        },
        {
            "rulenumber": 2,
            "rule": "For each challenge that your team completes the team will receive a fixed or variable amount of points depending on the points allotted for completion of the challenge."
        },
        {
            "rulenumber": 3,
            "rule": "Different hackers on the same team may be completing <strong>different</strong> challenges. So be sure to delegate well as a team!"
        },
        {
            "rulenumber": 4,
            "rule": "When you believe your team has completed a challenge, simply wave the light stick at your table. This will alert a judge to come check your work. If they deem the challenge completed your team will receive points. "
        },
        {
            "rulenumber": 5,
            "rule": "<strong>Startup Charades and Stack Overflow</strong> are two challenges that are extra special. In order for every team to participate, these challenges are scheduled by Team Number. To see what time slot your Team is scheduled to compete in a Required Challenge, visit <a style=\"color:white; text-decoration:underline\" href=\"http://thehackerolympics.com/teamschedule/\">the schedule</a>.  "
        },
        {
            "rulenumber": 6,
            "rule": "If you finish all available challenges, check the rules and attempt to get the bonus points for every challenge that has bonus points."
        },
        {
            "rule": "<strong>The Rules:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "You <strong>must</strong> form teams of 3-4 people (ideally teams will consist of 4 people). Once you have formed a team, choose a table. You will be given a team number and name when you check in. It is <strong>very important</strong> you memorize your Team Number, as the points your team earns will be tracked by your Team Number."
        },
        {
            "rulenumber": 2,
            "rule": "Please don't scare the panda."
        },
        {
            "rulenumber": 3,
            "rule": "No Larping. Even if you have a lightsaber from last years Hacker Olympics. Larping kills."
        },
        {
            "rule": "<strong>The Scoring:</strong>"
        },
        {
            "rulenumber": 1,
            "rule": "When a team (or hacker from a specific team) completes a challenge, Points will be added to your Team Number"
        },
        {
            "rulenumber": 2,
            "rule": "You can follow the rank of your team on the <a href=\"http://thehackerolympics.com/leaderboard/ \" style=\"color:white; text-decoration:underline\">Leaderboard</a>."
        },
        {
            "rulenumber": 3,
            "rule": "Some challenges are worth a fixed number of points. Other challenges are scored on a tier, where the team will be awarded points according to their placement. (Example: 1st Place: 100 pts, 2nd Place: 50 pts, 3rd Place: 25 pts). "
        }
    ]
}